In [8]:
import numpy as np
import pandas as pd

Finding missing Data

In [34]:
data = {
    "A": [1, 2, np.nan, 4],
    "B": [2, 3, 5, np.nan],
    "C": [3, 2, np.nan, 9],
    "D": [8, np.nan, 7, np.nan]
}
df = pd.DataFrame(data)

In [35]:
df

     A    B    C    D
0  1.0  2.0  3.0  8.0
1  2.0  3.0  2.0  NaN
2  NaN  5.0  NaN  7.0
3  4.0  NaN  9.0  NaN

In [36]:
df.isna().sum()

A    1
B    1
C    1
D    2
dtype: int64

In [37]:
df.isna().any()

A    True
B    True
C    True
D    True
dtype: bool

Removing Missing Data

In [38]:
df

     A    B    C    D
0  1.0  2.0  3.0  8.0
1  2.0  3.0  2.0  NaN
2  NaN  5.0  NaN  7.0
3  4.0  NaN  9.0  NaN

In [39]:
df.dropna()

     A    B    C    D
0  1.0  2.0  3.0  8.0

In [46]:
df.dropna(thresh=3)

     A    B    C    D
0  1.0  2.0  3.0  8.0
1  2.0  3.0  2.0  NaN

In [49]:
df

     A    B    C    D
0  1.0  2.0  3.0  8.0
1  2.0  3.0  2.0  NaN
2  NaN  5.0  NaN  7.0
3  4.0  NaN  9.0  NaN

Filling the missing Data

In [48]:
df.fillna(9)

     A    B    C    D
0  1.0  2.0  3.0  8.0
1  2.0  3.0  2.0  9.0
2  9.0  5.0  9.0  7.0
3  4.0  9.0  9.0  9.0

In [50]:
value = {"A": 120,"B": 97, "C": 789,"D": 102}
df.fillna(value=value)

       A     B      C      D
0    1.0   2.0    3.0    8.0
1    2.0   3.0    2.0  102.0
2  120.0   5.0  789.0    7.0
3    4.0  97.0    9.0  102.0